In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('data.csv')
data.info()
data.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья
1,1,-4024.803754,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля
2,0,-5623.422610,33,Среднее,1,женат / замужем,0,M,сотрудник,0,145885.952297,покупка жилья
3,3,-4124.747207,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.550329,дополнительное образование
4,0,340266.072047,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.077870,сыграть свадьбу

2. Предобработка данных

В двух столбцах есть пропущенные значения. Один из них — days_employed. Пропуски в этом столбце вы обработаете на следующем этапе. 
Найдите другой столбец и заполните пропущенные значения в нём медианным значением по столбцу:
опишите, какие пропущенные значения вы обнаружили;

проверьте, какую долю составляют пропущенные значения в каждом из столбцов с пропусками;
приведите возможные причины появления пропусков в данных;

объясните, почему заполнить пропуски медианным значением — лучшее решение для количественных переменных.

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

В нашем случае количество значений в столбце не равно количеству строк для двух столбцов:
1. days_employed
2. total_income

In [4]:
total_income_empty_entries = data.loc[data['total_income'].isna() == True]
total_income_empty_entries

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12,0,NaN,65,среднее,1,гражданский брак,1,M,пенсионер,0,NaN,сыграть свадьбу
26,0,NaN,41,среднее,1,женат / замужем,0,M,госслужащий,0,NaN,образование
29,0,NaN,63,среднее,1,Не женат / не замужем,4,F,пенсионер,0,NaN,строительство жилой недвижимости
41,0,NaN,50,среднее,1,женат / замужем,0,F,госслужащий,0,NaN,сделка с подержанным автомобилем
55,0,NaN,54,среднее,1,гражданский брак,1,F,пенсионер,1,NaN,сыграть свадьбу
...,...,...,...,...,...,...,...,...,...,...,...,...
21489,2,NaN,47,Среднее,1,женат / замужем,0,M,компаньон,0,NaN,сделка с автомобилем
21495,1,NaN,50,среднее,1,гражданский брак,1,F,сотрудник,0,NaN,свадьба
21497,0,NaN,48,ВЫСШЕЕ,0,женат / замужем,0,F,компаньон,0,NaN,строительство недвижимости
21502,1,NaN,42,среднее,1,женат / замужем,0,F,сотрудник,0,NaN,строительство жилой недвижимости
21510,2,NaN,28,среднее,1,женат / замужем,0,F,сотрудник,0,NaN,приобретение автомобиля

У данных людей есть тип дохода, но нет значения этого дохода. Скорее всего ошибка заполнения данных. Я бы предложила сгруппировать данные по income_type и записала в total_income медианное значение. Это позволит посчиать среднее значение зарплаты по группе без учета аномально низких и аномально высоких значений.

In [5]:
ratio = total_income_empty_entries.shape[0] / data.shape[0]
print('Доля пропущенных значений для колонки total income {0:.2%}'.format(ratio))

Доля пропущенных значений для колонки total income 10.10%

Мне кажется, усредненное значение это не очень полезный критерий

In [6]:
total_income_empty = data.loc[data['total_income'].isna() == True].groupby('income_type').count()['purpose']
total_income_empty_ratio = data.loc[data['total_income'].isna() == True].groupby('income_type').count()['purpose'] / data.groupby('income_type').count()['purpose']
total_income_empty_ratio

income_type
безработный             NaN
в декрете               NaN
госслужащий        0.100754
компаньон          0.099902
пенсионер          0.107106
предприниматель    0.500000
сотрудник          0.099379
студент                 NaN
Name: purpose, dtype: float64

Исходя из этой выгрузки мы знаем, что пропущенные данные есть у госслужащих, компаньонов, пенсионеров, предпринимателей и сотрудников.При этом если посмотреть, то 50% предпринемателей не указали total_income

In [7]:
mean_total_income_by_income_type = data.groupby('income_type')['total_income'].mean()
mean_total_income_by_income_type

income_type
безработный        131339.751676
в декрете           53829.130729
госслужащий        170898.309923
компаньон          202417.461462
пенсионер          137127.465690
предприниматель    499163.144947
сотрудник          161380.260488
студент             98201.625314
Name: total_income, dtype: float64

Таким образом получили средние значения, а теперь посмотрим на медианные

In [8]:
median_total_income_by_income_type = data.groupby('income_type')['total_income'].median()
median_total_income_by_income_type

income_type
безработный        131339.751676
в декрете           53829.130729
госслужащий        150447.935283
компаньон          172357.950966
пенсионер          118514.486412
предприниматель    499163.144947
сотрудник          142594.396847
студент             98201.625314
Name: total_income, dtype: float64

Судя по тому что медиана и среденее для предпринимателей одинаковая, данная выборка либо очень мала, либо слишком однородна.

Теперь сделаем замены

In [9]:
income_types_with_empty = ('госслужащий', 'компаньон', 'пенсионер', 'предприниматель', 'сотрудник')
for income_type in income_types_with_empty:
    data.loc[(data['income_type'] == income_type) & (data['total_income'].isna() == True), 'total_income'] = median_total_income_by_income_type.loc[income_type]

In [10]:
data.loc[data['total_income'].isna() == True]

Empty DataFrame
Columns: [children, days_employed, dob_years, education, education_id, family_status, family_status_id, gender, income_type, debt, total_income, purpose]
Index: []

Все пропуски заполнены. Можно переходить к следующему этапу

2. В данных могут встречаться артефакты (аномалии) — значения, которые не отражают действительность и появились по какой-то ошибке. Например, отрицательное количество дней трудового стажа в столбце days_employed. Для реальных данных это нормально. Обработайте значения в столбцах с аномалиями и опишите возможные причины появления таких данных. После обработки аномалий заполните пропуски в days_employed медианными значениями по этому столбцу.

In [11]:
print('Do it later')

Do it later

3. Замените вещественный тип данных в столбце total_income на целочисленный, например, с помощью метода astype().

In [12]:
data = data.astype({'total_income': 'int'})
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      21525 non-null  int64
 11  purpose           21525 non-null  object
dtypes: float64(1), int64(6), object(5)
memory usage: 2.0+ MB

4. Если в данных присутствуют строки-дубликаты, удалите их. Также обработайте неявные дубликаты. Например, в столбце education есть одни и те же значения, но записанные по-разному: с использованием заглавных и строчных букв. Приведите их к одному регистру. Проверьте остальные столбцы.
После удаления дубликатов сделайте следующее:
поясните, как выбирали метод для поиска и удаления дубликатов в данных;
приведите возможные причины появления дубликатов.

In [13]:
data.duplicated().sum()

54

In [14]:
data['education'].value_counts()

среднее                13750
высшее                  4718
СРЕДНЕЕ                  772
Среднее                  711
неоконченное высшее      668
ВЫСШЕЕ                   274
Высшее                   268
начальное                250
Неоконченное высшее       47
НЕОКОНЧЕННОЕ ВЫСШЕЕ       29
НАЧАЛЬНОЕ                 17
Начальное                 15
ученая степень             4
Ученая степень             1
УЧЕНАЯ СТЕПЕНЬ             1
Name: education, dtype: int64

In [15]:
data['education'] = data['education'].str.lower()

In [16]:
data['education'].value_counts()

среднее                15233
высшее                  5260
неоконченное высшее      744
начальное                282
ученая степень             6
Name: education, dtype: int64

In [17]:
data['family_status'].value_counts()

женат / замужем          12380
гражданский брак          4177
Не женат / не замужем     2813
в разводе                 1195
вдовец / вдова             960
Name: family_status, dtype: int64

Собрала несколько вольную группировку что во что переименовать. Есть сомнения с группировкой "жилье" в обычной жизни пошла бы к поставщикам данных уточнить когда что пишут

In [18]:
purposes_rename_dict = {
    'свадьба':  ['на проведение свадьбы', 'сыграть свадьбу'],
    'коммерческая недвижимость': ['покупка коммерческой недвижимости', 'покупка жилья для сдачи', 'операции с жильем', 'операции с коммерческой недвижимостью'],
    'жилье': ['покупка жилья', 'покупка жилья для семьи', 'покупка своего жилья', 'покупка жилой недвижимости', 'строительство собственной недвижимости', 'операции со своей недвижимостью', 'строительство жилой недвижимости', 'покупка недвижимости', 'недвижимость', 'строительство недвижимости', 'ремонт жилью', 'операции с недвижимостью'],              
    'автомобиль': ['сделка с подержанным автомобилем', 'свой автомобиль', 'на покупку подержанного автомобиля', 'автомобили', 'на покупку автомобиля', 'приобретение автомобиля', 'сделка с автомобилем', 'на покупку своего автомобиля'],
    'образование': ['высшее образование', 'получение высшего образования', 'заняться образованием', 'профильное образование', 'получение образования', 'получение дополнительного образования', 'дополнительное образование', 'заняться высшим образованием'],
}
for final_name, bad_names in purposes_rename_dict.items():
    for name in bad_names:
        data.loc[data['purpose'] == name, 'purpose'] = final_name

In [19]:
data['purpose'].value_counts()

жилье                        8219
автомобиль                   4315
образование                  4022
коммерческая недвижимость    2621
свадьба                      2348
Name: purpose, dtype: int64

In [20]:
data.columns

Index(['children', 'days_employed', 'dob_years', 'education', 'education_id',
       'family_status', 'family_status_id', 'gender', 'income_type', 'debt',
       'total_income', 'purpose'],
      dtype='object')

In [21]:
data['gender'].value_counts()

F      14236
M       7288
XNA        1
Name: gender, dtype: int64

In [22]:
data[data['gender'] == 'XNA']

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
10701,0,-2358.600502,24,неоконченное высшее,2,гражданский брак,1,XNA,компаньон,0,203905,жилье

In [23]:
data.drop(data[data['gender'] == 'XNA'].index, inplace=True)
data['gender'].value_counts()

F    14236
M     7288
Name: gender, dtype: int64

In [24]:
data['children'].value_counts()

 0     14148
 1      4818
 2      2055
 3       330
 20       76
-1        47
 4        41
 5         9
Name: children, dtype: int64

In [25]:
data.loc[data['children'] == 20]

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
606,20,-880.221113,21,среднее,1,женат / замужем,0,M,компаньон,0,145334,жилье
720,20,-855.595512,44,среднее,1,женат / замужем,0,F,компаньон,0,112998,жилье
1074,20,-3310.411598,56,среднее,1,женат / замужем,0,F,сотрудник,1,229518,образование
2510,20,-2714.161249,59,высшее,0,вдовец / вдова,2,F,сотрудник,0,264474,коммерческая недвижимость
2941,20,-2161.591519,0,среднее,1,женат / замужем,0,F,сотрудник,0,199739,автомобиль
...,...,...,...,...,...,...,...,...,...,...,...,...
21008,20,-1240.257910,40,среднее,1,женат / замужем,0,F,сотрудник,1,133524,автомобиль
21325,20,-601.174883,37,среднее,1,женат / замужем,0,F,компаньон,0,102986,образование
21390,20,NaN,53,среднее,1,женат / замужем,0,M,компаньон,0,172357,жилье
21404,20,-494.788448,52,среднее,1,женат / замужем,0,M,компаньон,0,156629,жилье
21491,20,-173.954460,27,среднее,1,женат / замужем,0,F,сотрудник,0,155520,автомобиль

In [26]:
data.loc[data['children'].isin([-1, 20]), 'children'] = 0
data['dob_years'].value_counts().sort_index()

0     101
19     14
20     51
21    111
22    183
23    254
24    263
25    357
26    408
27    493
28    503
29    545
30    540
31    560
32    510
33    581
34    603
35    617
36    555
37    537
38    598
39    573
40    609
41    607
42    597
43    513
44    547
45    497
46    475
47    480
48    538
49    508
50    514
51    448
52    484
53    459
54    479
55    443
56    487
57    460
58    461
59    444
60    377
61    355
62    352
63    269
64    265
65    194
66    183
67    167
68     99
69     85
70     65
71     58
72     33
73      8
74      6
75      1
Name: dob_years, dtype: int64

In [27]:
median_age = int(data.loc[data['dob_years'] != 0, 'dob_years'].median())
median_age

43

In [28]:
data.loc[(data['dob_years'] == 0), 'dob_years'] = median_age
data['dob_years'].value_counts().sort_index()

19     14
20     51
21    111
22    183
23    254
24    263
25    357
26    408
27    493
28    503
29    545
30    540
31    560
32    510
33    581
34    603
35    617
36    555
37    537
38    598
39    573
40    609
41    607
42    597
43    614
44    547
45    497
46    475
47    480
48    538
49    508
50    514
51    448
52    484
53    459
54    479
55    443
56    487
57    460
58    461
59    444
60    377
61    355
62    352
63    269
64    265
65    194
66    183
67    167
68     99
69     85
70     65
71     58
72     33
73      8
74      6
75      1
Name: dob_years, dtype: int64

5. Создайте два новых датафрейма, в которых:
каждому уникальному значению из education соответствует уникальное значение education_id — в первом;
каждому уникальному значению из family_status соответствует уникальное значение family_status_id — во втором.
Удалите из исходного датафрейма столбцы education и family_status, оставив только их идентификаторы: education_id и family_status_id. Новые датафреймы — это те самые «словари» (не путайте с одноимённой структурой данных в Python), к которым вы сможете обращаться по идентификатору.

In [29]:
education_dict = data.loc[:, ('education_id', 'education')].drop_duplicates().reset_index(drop=True)
education_dict

   education_id            education
0             0               высшее
1             1              среднее
2             2  неоконченное высшее
3             3            начальное
4             4       ученая степень

In [30]:
family_status_dict = data.loc[:, ('family_status_id', 'family_status')].drop_duplicates().reset_index(drop=True)
family_status_dict

   family_status_id          family_status
0                 0        женат / замужем
1                 1       гражданский брак
2                 2         вдовец / вдова
3                 3              в разводе
4                 4  Не женат / не замужем

In [31]:
data = data.drop(['education', 'family_status'], axis=1)
data.columns

Index(['children', 'days_employed', 'dob_years', 'education_id',
       'family_status_id', 'gender', 'income_type', 'debt', 'total_income',
       'purpose'],
      dtype='object')

In [32]:
print('Количество дубликатов после нормализации данных:', data.duplicated().sum())
data=data.drop_duplicates().reset_index(drop=True)
print('Проверка успешности зачистки дубликатов:', data.duplicated().sum())

Количество дубликатов после нормализации данных: 335
Проверка успешности зачистки дубликатов: 0

6. На основании диапазонов, указанных ниже, создайте столбец total_income_category с категориями:
0–30000 — 'E';
30001–50000 — 'D';
50001–200000 — 'C';
200001–1000000 — 'B';
1000001 и выше — 'A'.
Например, кредитополучателю с доходом 25000 нужно назначить категорию 'E', а клиенту, получающему 235000, — 'B'.

In [33]:
def get_total_income_category(total_income):
    if 0 <= total_income <= 30000:
        return 'E'
    if 30000 < total_income <= 50000:
        return 'D'
    if 50000 < total_income <= 200000:
        return 'C'
    if 200000 < total_income <= 1000000:
        return 'B'
    if 1000000 < total_income:
        return 'A'
    return 'ERROR: negative income'

In [34]:
data['total_income_category'] = data['total_income'].apply(get_total_income_category)
data['total_income_category'].value_counts()

C    15751
B     5041
D      350
A       25
E       22
Name: total_income_category, dtype: int64

7. Создайте функцию, которая на основании данных из столбца purpose сформирует новый столбец purpose_category, в который войдут следующие категории:
'операции с автомобилем',
'операции с недвижимостью',
'проведение свадьбы',
'получение образования'.
Например, если в столбце purpose находится подстрока 'на покупку автомобиля', то в столбце purpose_category должна появиться строка 'операции с автомобилем'.
Вы можете использовать собственную функцию и метод apply(). Изучите данные в столбце purpose и определите, какие подстроки помогут вам правильно определить категорию.

In [35]:
data['purpose'].value_counts()

жилье                        8041
автомобиль                   4271
образование                  3964
коммерческая недвижимость    2607
свадьба                      2306
Name: purpose, dtype: int64

In [36]:
def get_purpose_category(purpose):
    if 'свадьб' in purpose:
        return 'проведение свадьбы'
    if 'автомобил' in purpose:
        return 'операции с автомобилем'
    if 'образовани' in purpose:
        return 'получение образования'
    if 'недвижимост' in purpose or 'жиль' in purpose:
        return 'операции с недвижимостью'
    return 'ERROR unknown purpose category'

In [37]:
data['purpose_category'] = data['purpose'].apply(get_purpose_category)
data['purpose_category'].value_counts()

операции с недвижимостью    10648
операции с автомобилем       4271
получение образования        3964
проведение свадьбы           2306
Name: purpose_category, dtype: int64

2.1. Есть ли зависимость между количеством детей и возвратом кредита в срок?

In [38]:
data.loc[:,['children', 'debt']].pivot_table(index='children', values='debt', aggfunc='sum')

          debt
children
0         1070
1          444
2          194
3           27
4            4
5            0

In [39]:
data.loc[:,['children', 'debt']].pivot_table(index='children', values='debt', aggfunc='mean')

              debt
children
0         0.076434
1         0.093121
2         0.094912
3         0.082067
4         0.100000
5         0.000000

3.2 Есть ли зависимость между семейным положением и возвратом кредита в срок?

In [40]:
data.loc[:,['family_status_id', 'debt']].pivot_table(index='family_status_id', values='debt', aggfunc='mean').merge(family_status_dict, on='family_status_id')

   family_status_id      debt          family_status
0                 0  0.076568        женат / замужем
1                 1  0.094015       гражданский брак
2                 2  0.066737         вдовец / вдова
3                 3  0.071249              в разводе
4                 4  0.098138  Не женат / не замужем

In [41]:
data.loc[:,['family_status_id', 'debt']].pivot_table(index='family_status_id', values='debt', aggfunc='sum').merge(family_status_dict, on='family_status_id')

   family_status_id  debt          family_status
0                 0   929        женат / замужем
1                 1   388       гражданский брак
2                 2    63         вдовец / вдова
3                 3    85              в разводе
4                 4   274  Не женат / не замужем

3.3 Есть ли зависимость между уровнем дохода и возвратом кредита в срок?

In [42]:
data.loc[:,['total_income_category', 'debt']].pivot_table(index='total_income_category', values='debt', aggfunc='mean')

                           debt
total_income_category
A                      0.080000
B                      0.070621
C                      0.086217
D                      0.060000
E                      0.090909

In [43]:
data.loc[:,['total_income_category', 'debt']].pivot_table(index='total_income_category', values='debt', aggfunc='sum')

                       debt
total_income_category
A                         2
B                       356
C                      1358
D                        21
E                         2

3.4 Как разные цели кредита влияют на его возврат в срок?

In [44]:
data.loc[:,['purpose_category', 'debt']].pivot_table(index='purpose_category', values='debt', aggfunc='mean')

                              debt
purpose_category
операции с автомобилем    0.094123
операции с недвижимостью  0.073347
получение образования     0.093340
проведение свадьбы        0.080659

In [45]:
data.loc[:,['purpose_category', 'debt']].pivot_table(index='purpose_category', values='debt', aggfunc='sum')

                          debt
purpose_category
операции с автомобилем     402
операции с недвижимостью   781
получение образования      370
проведение свадьбы         186